import "./NewsItem.scss";

const NewsItem = ({ isOpen, toggleSidebar }) => {
	return (
		<aside className={`Sidebar Sidebar__news ${isOpen ? "is--open" : ""}`}>
			<div className="Sidebar__overlay" onClick={toggleSidebar}></div>
			<div className="Sidebar__content">
				<div className="Sidebar__content-header">
					<h6>تفاصيل الخبر</h6>
					<button type="button" onClick={toggleSidebar}>
						<svg
							xmlns="http://www.w3.org/2000/svg"
							fill="none"
							viewBox="0 0 20 20"
						>
							<path
								fill="currentColor"
								d="M15.375 17.21 10 11.835 4.625 17.21a.988.988 0 0 1-1.398 0l-.437-.437a.988.988 0 0 1 0-1.398L8.165 10 2.79 4.625a.988.988 0 0 1 0-1.398l.437-.437a.988.988 0 0 1 1.398 0L10 8.165l5.375-5.375a.988.988 0 0 1 1.398 0l.437.437a.988.988 0 0 1 0 1.398L11.835 10l5.375 5.375a.988.988 0 0 1 0 1.398l-.437.437a.988.988 0 0 1-1.398 0Z"
							/>
						</svg>
					</button>
				</div>
				<div className="Sidebar__content-top">
					<div className="overlay"></div>
					<h1>
						أعلن المتحدث الرسمي لرئاسة أمن الدولة السعودية، الاثنين،
						نتائج التحقيقات
					</h1>
				</div>
				<div className="Sidebar__content-scroll">
					<div className="Sidebar__content-content">
						<div className="time">
							<svg
								width="20"
								height="20"
								viewBox="0 0 20 20"
								fill="none"
								xmlns="http://www.w3.org/2000/svg"
							>
								<path
									d="M10.0013 18.9557C5.05964 18.9557 1.04297 14.9391 1.04297 9.9974C1.04297 5.05573 5.05964 1.03906 10.0013 1.03906C14.943 1.03906 18.9596 5.05573 18.9596 9.9974C18.9596 14.9391 14.943 18.9557 10.0013 18.9557ZM10.0013 2.28906C5.7513 2.28906 2.29297 5.7474 2.29297 9.9974C2.29297 14.2474 5.7513 17.7057 10.0013 17.7057C14.2513 17.7057 17.7096 14.2474 17.7096 9.9974C17.7096 5.7474 14.2513 2.28906 10.0013 2.28906Z"
									fill="#292D32"
								/>
								<path
									d="M13.0909 13.2745C12.9826 13.2745 12.8742 13.2495 12.7742 13.1828L10.1909 11.6411C9.54922 11.2578 9.07422 10.4161 9.07422 9.67448V6.25781C9.07422 5.91615 9.35755 5.63281 9.69922 5.63281C10.0409 5.63281 10.3242 5.91615 10.3242 6.25781V9.67448C10.3242 9.97448 10.5742 10.4161 10.8326 10.5661L13.4159 12.1078C13.7159 12.2828 13.8076 12.6661 13.6326 12.9661C13.5076 13.1661 13.2992 13.2745 13.0909 13.2745Z"
									fill="#292D32"
								/>
							</svg>
							<span>١٢ يناير ٢٠٢٤</span>
						</div>
						<p>
							توفر الهيئة العامة للعناية بشؤون المسجد النبوي مياه
							زمزم من مكة إلى المدينة باستجابة لافتة، حتى يستطيع
							قاصد الحرمين الحصول على المياه على مدار اليوم، إذ
							تهتم إدارة السقيا بالإشراف المباشر على نقل زمزم من
							مكة المكرمة إلى المسجد النبوي عبر ناقلات معدة ومهيأة
							لهذا الغرض. إذ تورد مياه زمزم للمسجد النبوي بمعدل
							يصل إلى أكثر من 400,000 لتر يوميًا خلال شهر رمضان،
							موزعة على (15) ألف حافظة، إذ تتسع الناقلة الواحدة
							لعشرين طنًا من الماء، تُنظف وتعقم باستمرار من قبل
							مراقبي السقيا، وتفرغ بعدئذ في خزانات رئيسة مفلترة
							ومنها إلى خزانات فرعية.
						</p>
						<p>
							إذ تورد مياه زمزم للمسجد النبوي بمعدل يصل إلى أكثر
							من 400,000 لتر يوميًا خلال شهر رمضان، موزعة على (15)
							ألف حافظة، إذ تتسع الناقلة الواحدة لعشرين طنًا من
							الماء، تُنظف وتعقم باستمرار من قبل مراقبي السقيا،
							وتفرغ بعدئذ في خزانات رئيسة مفلترة ومنها إلى خزانات
							فرعية.
						</p>
						<p>
							توفر الهيئة العامة للعناية بشؤون المسجد النبوي مياه
							زمزم من مكة إلى المدينة باستجابة لافتة، حتى يستطيع
							قاصد الحرمين الحصول على المياه على مدار اليوم، إذ
							تهتم إدارة السقيا بالإشراف المباشر على نقل زمزم من
							مكة المكرمة إلى المسجد النبوي عبر ناقلات معدة ومهيأة
							لهذا الغرض. إذ تورد مياه زمزم للمسجد النبوي بمعدل
							يصل إلى أكثر من 400,000 لتر يوميًا خلال شهر رمضان،
							موزعة على (15) ألف حافظة، إذ تتسع الناقلة الواحدة
							لعشرين طنًا من الماء، تُنظف وتعقم باستمرار من قبل
							مراقبي السقيا، وتفرغ بعدئذ في خزانات رئيسة مفلترة
							ومنها إلى خزانات فرعية.
						</p>
						<p>
							إذ تورد مياه زمزم للمسجد النبوي بمعدل يصل إلى أكثر
							من 400,000 لتر يوميًا خلال شهر رمضان، موزعة على (15)
							ألف حافظة، إذ تتسع الناقلة الواحدة لعشرين طنًا من
							الماء، تُنظف وتعقم باستمرار من قبل مراقبي السقيا،
							وتفرغ بعدئذ في خزانات رئيسة مفلترة ومنها إلى خزانات
							فرعية.
						</p>
						<p>
							توفر الهيئة العامة للعناية بشؤون المسجد النبوي مياه
							زمزم من مكة إلى المدينة باستجابة لافتة، حتى يستطيع
							قاصد الحرمين الحصول على المياه على مدار اليوم، إذ
							تهتم إدارة السقيا بالإشراف المباشر على نقل زمزم من
							مكة المكرمة إلى المسجد النبوي عبر ناقلات معدة ومهيأة
							لهذا الغرض. إذ تورد مياه زمزم للمسجد النبوي بمعدل
							يصل إلى أكثر من 400,000 لتر يوميًا خلال شهر رمضان،
							موزعة على (15) ألف حافظة، إذ تتسع الناقلة الواحدة
							لعشرين طنًا من الماء، تُنظف وتعقم باستمرار من قبل
							مراقبي السقيا، وتفرغ بعدئذ في خزانات رئيسة مفلترة
							ومنها إلى خزانات فرعية.
						</p>
						<p>
							إذ تورد مياه زمزم للمسجد النبوي بمعدل يصل إلى أكثر
							من 400,000 لتر يوميًا خلال شهر رمضان، موزعة على (15)
							ألف حافظة، إذ تتسع الناقلة الواحدة لعشرين طنًا من
							الماء، تُنظف وتعقم باستمرار من قبل مراقبي السقيا،
							وتفرغ بعدئذ في خزانات رئيسة مفلترة ومنها إلى خزانات
							فرعية.
						</p>
					</div>
				</div>
			</div>
		</aside>
	);
};
export default NewsItem;